#+TITLE: systemd
#+DATE: Wednesday, Mar 02 2016

* units

  #+HEADER: :exports both :eval no-export
  #+BEGIN_SRC python :results output
    systemctl list-unit-files
    systemctl list-unit-files --state=disabled
  #+END_SRC

  #+RESULTS:

** dependencies of unit

   #+HEADER: :exports both :eval no-export
   #+BEGIN_SRC sh :results output
     systemctl list-dependencies
   #+END_SRC

   #+RESULTS:
   #+begin_example
   default.target
   в—Џ в”њв”Ђdisplay-manager.service
   в—Џ в””в”Ђmulti-user.target
   в—Џ   в”њв”Ђdbus.service
   в—Џ   в”њв”ЂModemManager.service
   в—Џ   в”њв”ЂNetworkManager.service
   в—Џ   в”њв”Ђsystemd-ask-password-wall.path
   в—Џ   в”њв”Ђsystemd-logind.service
   в—Џ   в”њв”Ђsystemd-user-sessions.service
   в—Џ   в”њв”Ђbasic.target
   в—Џ   в”‚ в”њв”Ђ-.mount
   в—Џ   в”‚ в”њв”Ђtmp.mount
   в—Џ   в”‚ в”њв”Ђvar.mount
   в—Џ   в”‚ в”њв”Ђpaths.target
   в—Џ   в”‚ в”њв”Ђslices.target
   в—Џ   в”‚ в”‚ в”њв”Ђ-.slice
   в—Џ   в”‚ в”‚ в””в”Ђsystem.slice
   в—Џ   в”‚ в”њв”Ђsockets.target
   в—Џ   в”‚ в”‚ в”њв”Ђdbus.socket
   в—Џ   в”‚ в”‚ в”њв”Ђdm-event.socket
   в—Џ   в”‚ в”‚ в”њв”Ђsystemd-coredump.socket
   в—Џ   в”‚ в”‚ в”њв”Ђsystemd-initctl.socket
   в—Џ   в”‚ в”‚ в”њв”Ђsystemd-journald-audit.socket
   в—Џ   в”‚ в”‚ в”њв”Ђsystemd-journald-dev-log.socket
   в—Џ   в”‚ в”‚ в”њв”Ђsystemd-journald.socket
   в—Џ   в”‚ в”‚ в”њв”Ђsystemd-udevd-control.socket
   в—Џ   в”‚ в”‚ в””в”Ђsystemd-udevd-kernel.socket
   в—Џ   в”‚ в”њв”Ђsysinit.target
   в—Џ   в”‚ в”‚ в”њв”Ђdev-hugepages.mount
   в—Џ   в”‚ в”‚ в”њв”Ђdev-mqueue.mount
   в—Џ   в”‚ в”‚ в”њв”Ђkmod-static-nodes.service
   в—Џ   в”‚ в”‚ в”њв”Ђldconfig.service
   в—Џ   в”‚ в”‚ в”њв”Ђlvm2-lvmetad.socket
   в—Џ   в”‚ в”‚ в”њв”Ђlvm2-lvmpolld.socket
   в—Џ   в”‚ в”‚ в”њв”Ђlvm2-monitor.service
   в—Џ   в”‚ в”‚ в”њв”Ђproc-sys-fs-binfmt_misc.automount
   в—Џ   в”‚ в”‚ в”њв”Ђsys-fs-fuse-connections.mount
   в—Џ   в”‚ в”‚ в”њв”Ђsys-kernel-config.mount
   в—Џ   в”‚ в”‚ в”њв”Ђsys-kernel-debug.mount
   в—Џ   в”‚ в”‚ в”њв”Ђsys-kernel-tracing.mount
   в—Џ   в”‚ в”‚ в”њв”Ђsystemd-ask-password-console.path
   в—Џ   в”‚ в”‚ в”њв”Ђsystemd-binfmt.service
   в—Џ   в”‚ в”‚ в”њв”Ђsystemd-boot-system-token.service
   в—Џ   в”‚ в”‚ в”њв”Ђsystemd-firstboot.service
   в—Џ   в”‚ в”‚ в”њв”Ђsystemd-hwdb-update.service
   в—Џ   в”‚ в”‚ в”њв”Ђsystemd-journal-catalog-update.service
   в—Џ   в”‚ в”‚ в”њв”Ђsystemd-journal-flush.service
   в—Џ   в”‚ в”‚ в”њв”Ђsystemd-journald.service
   в—Џ   в”‚ в”‚ в”њв”Ђsystemd-machine-id-commit.service
   в—Џ   в”‚ в”‚ в”њв”Ђsystemd-modules-load.service
   в—Џ   в”‚ в”‚ в”њв”Ђsystemd-random-seed.service
   в—Џ   в”‚ в”‚ в”њв”Ђsystemd-sysctl.service
   в—Џ   в”‚ в”‚ в”њв”Ђsystemd-sysusers.service
   в—Џ   в”‚ в”‚ в”њв”Ђsystemd-timesyncd.service
   в—Џ   в”‚ в”‚ в”њв”Ђsystemd-tmpfiles-setup-dev.service
   в—Џ   в”‚ в”‚ в”њв”Ђsystemd-tmpfiles-setup.service
   в—Џ   в”‚ в”‚ в”њв”Ђsystemd-udev-trigger.service
   в—Џ   в”‚ в”‚ в”њв”Ђsystemd-udevd.service
   в—Џ   в”‚ в”‚ в”њв”Ђsystemd-update-done.service
   в—Џ   в”‚ в”‚ в”њв”Ђsystemd-update-utmp.service
   в—Џ   в”‚ в”‚ в”њв”Ђcryptsetup.target
   в—Џ   в”‚ в”‚ в”њв”Ђlocal-fs.target
   в—Џ   в”‚ в”‚ в”‚ в”њв”Ђ-.mount
   в—Џ   в”‚ в”‚ в”‚ в”њв”Ђboot.mount
   в—Џ   в”‚ в”‚ в”‚ в”њв”Ђhome.mount
   в—Џ   в”‚ в”‚ в”‚ в”њв”Ђsystemd-fsck-root.service
   в—Џ   в”‚ в”‚ в”‚ в”њв”Ђsystemd-remount-fs.service
   в—Џ   в”‚ в”‚ в”‚ в”њв”Ђtmp.mount
   в—Џ   в”‚ в”‚ в”‚ в””в”Ђvar.mount
   в—Џ   в”‚ в”‚ в””в”Ђswap.target
   в—Џ   в”‚ в”‚   в””в”Ђdev-sda9.swap
   в—Џ   в”‚ в””в”Ђtimers.target
   в—Џ   в”‚   в”њв”Ђlogrotate.timer
   в—Џ   в”‚   в”њв”Ђman-db.timer
   в—Џ   в”‚   в”њв”Ђshadow.timer
   в—Џ   в”‚   в”њв”Ђsystemd-tmpfiles-clean.timer
   в—Џ   в”‚   в””в”Ђupdatedb.timer
   в—Џ   в”њв”Ђgetty.target
   в—Џ   в”‚ в””в”Ђgetty@tty1.service
   в—Џ   в””в”Ђremote-fs.target
   в—Џ     в””в”Ђvar-lib-machines.mount
   #+end_example

* Enable getty

  #+BEGIN_SRC bash
    systemctl enable getty@tty1.service
  #+END_SRC

* Disable Clearing of Boot Messages
  based on: [[https://wiki.archlinux.org/index.php/Systemd_FAQ#How_do_I_get_more_verbose_output_during_boot.3F][Arch Wiki]]

  After the boot process, the screen is cleared and the login prompt
  appears, leaving users unable to read init output and error
  messages.

** change in source

   #+BEGIN_SRC bash
     sed '/TTYVTDisallocate=/s/yes/no/' /usr/lib/systemd/system/getty@.service
   #+END_SRC

** using override

   systemd enable only support symlink since mid 2017 (too me long to
   realize don't know exact date, was saved by reserved VT) so
   override is better method since, source will be reset when systemd
   updates.

   #+BEGIN_SRC bash
     cat << EOF > /etc/systemd/system/getty@tty1.service.d/noclear.conf
     [Service]
     TTYVTDisallocate=no
     EOF
   #+END_SRC

* Autologin
  based on: [[https://wiki.archlinux.org/index.php/getty][Arch Wiki]]

  #+BEGIN_SRC bash
    cat << EOF > /etc/systemd/system/getty@tty1.service.d/override.conf
    [Service]
    ExecStart=
    ExecStart=-/usr/bin/agetty --autologin $USER --noclear %I $TERM
    EOF
  #+END_SRC

* Using systemd --user
  based on: [[https://wiki.archlinux.org/index.php/Systemd/User][Arch Wiki]], [[https://bitbucket.org/KaiSforza/systemd-user-units][KaiSforza's Guide]]

  Using =systemctl --system= to do anything requires *root* privileges
  and is therefore not useful to unprivileged users.

* slice

  # /etc/systemd/system/limit-512M.slice

  #+BEGIN_EXAMPLE
    [Unit]
    Description=Slice with MemoryLimit=512M
    Before=slices.target

    [Slice]
    MemoryAccounting=true
    MemoryLimit=512M
  #+END_EXAMPLE


  then you can run program in that slice and memory accounting will be
  enabled:

  systemd-run --slice limit512M --scope google-chrome-stable
